package Lesson6;

public class Main {

    /*
Задание 6.1
    Приведите пример использования древовидной структуры.
        1.Классификации видов животных 2.организационная структура предприятия. 3. Генеалогическое древо
    */

    /*
Задание 6.2
    Реализуйте класс узла дерева и базовый шаблон дерева с базовыми методами.
Задание 6.3
    Реализуйте методы поиска и вставки узла в дерево.
Задание 6.4
    Реализуйте базовые методы обхода дерева и метода дисплей.
    Реализуйте поиск максимума и минимума.
Задание 6.5
    Реализуйте метод удаления узла и выполните оценку времени базовых методов дерева с помощью System.nanoTime().
Задание 6.6
    Реализуйте на основе массива из задания 2.1 алгоритм пирамидальной сортировки с реализацией бинарной пирамиды.
    Выполните оценку алгоритма пирамидальной сортировки с помощью System.nanoTime() и сравните с предыдущими алгоритмами сортировки.
Задание 6.7
    Приведите пример сбалансированного дерева и его применения.
     */
}
