package Lesson5;

public class ObjectOrientedProgramming {
    public static void main(String[] args) {
/**

    * Создать класс "Сотрудник" с полями: ФИО, должность, email, телефон, зарплата, возраст;
    * Конструктор класса должен заполнять эти поля при создании объекта;
    * Внутри класса «Сотрудник» написать метод, который выводит информацию об объекте в консоль;
    * Создать массив из 5 сотрудников

    * С помощью цикла вывести информацию только о сотрудниках старше 40 лет;
 **/
    }
}
